# Tutorial de pandas

*pandas* es la librería de Python para Análisis de Datos.

*pandas* proporciona dos estructuras de datos principales: 
* *Series*: array de 1 dimensión con etiquetas
* *DataFrames*: array de 2 dimensiones con etiquetas

Las principales características de pandas son:
* Importación de Datos
* Limpieza de Datos
* Manipulación de Datos
* Cálculos Estadísticos
* Combinación de Datos
* Manipulación de Series Temporales

Otros recursos sobre *Pandas*:
- Manual de Referencia: https://pandas.pydata.org/pandas-docs/stable/
- Python for Data Analysis, Wes McKinney
- Python Data Science Handbook, Jave VanderPlas

In [50]:
import pandas as pd

## Series en Pandas
* *Series*: array de 1 dimensión con etiquetas

In [51]:
ser = pd.Series([100, 'foo', 300, 'bar', 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])

In [52]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [53]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [54]:
# Consulta por Etiqueta
ser[['nancy','bob']]
#ser.loc[['nancy','bob']]

nancy    300
bob      foo
dtype: object

In [55]:
# Consulta por Indice
ser[[4, 3, 1]]
#ser.iloc[[4, 3, 1]]

eric    500
dan     bar
bob     foo
dtype: object

In [56]:
'bob' in ser

True

In [57]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [58]:
ser * 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [59]:
'foo'*2

'foofoo'

In [60]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [61]:
ser[['nancy', 'eric']] ** 2

nancy     90000
eric     250000
dtype: object

In [62]:
ser[['nancy', 'eric']] /2

nancy    150
eric     250
dtype: object

## *DataFrame* en Pandas
* *DataFrame*: array de 2 dimensiones con etiquetas

### Crear un DataFrame a partir de un Diccionario de Python

In [63]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [64]:
df = pd.DataFrame(d)
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [65]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [66]:
df.columns

Index(['one', 'two'], dtype='object')

In [67]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [68]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

### Crear un DataFrame a partir de una Lista de Python

In [69]:
data = [{'alex': 1, 'alice': 3, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]
data

[{'alex': 1, 'alice': 3, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [70]:
pd.DataFrame(data)

   alex  alice  dora  ema  joe
0   1.0      3   NaN  NaN  2.0
1   NaN     20  10.0  5.0  NaN

In [71]:
pd.DataFrame(data, index=['orange', 'red'])

        alex  alice  dora  ema  joe
orange   1.0      3   NaN  NaN  2.0
red      NaN     20  10.0  5.0  NaN

In [72]:
pd.DataFrame(data, columns = ['joe', 'dora','alice', 'ema'], index = [0,1])

   joe  dora  alice  ema
0  2.0   NaN      3  NaN
1  NaN  10.0     20  5.0

### Operaciones con DataFrame

In [73]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [74]:
df['two']

apple      111.0
ball       222.0
cerill     333.0
clock        NaN
dancy     4444.0
Name: two, dtype: float64

In [75]:
df['three'] = df['one'] * df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [76]:
df['flag'] = df['one'] > 250
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [77]:
# Borrar y Obtener una columna
three = df.pop('three')

In [78]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [79]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [80]:
# Borrar una columna
del df['two']

In [81]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [82]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [83]:
df[['one', 'flag']]

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [84]:
# Añadir una columna
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

In [85]:
# Añadir una columna
df['one_upper_half'] = df['one'][:2]
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [86]:
df['one'][:3]

apple     100.0
ball      200.0
cerill      NaN
Name: one, dtype: float64

In [87]:
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [88]:
(df['one'] == 100) | (df['copy_of_one'] == 300)

apple      True
ball      False
cerill    False
clock      True
dancy     False
dtype: bool

In [89]:
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [90]:
# Filtrado de Datos
#df[df['one'] == 100]
df[(df['one'] == 100) | (df['copy_of_one'] == 300)]
#df[df['one'].isnull()]

         one   flag  copy_of_one  one_upper_half
apple  100.0  False        100.0           100.0
clock  300.0   True        300.0             NaN

In [91]:
s1 = df['one']
print(type(s1))
s1.unique()

<class 'pandas.core.series.Series'>

array([100., 200.,  nan, 300.])

In [92]:
df['two'] = [200, 400, 500, 600, 500]

In [93]:
df

          one   flag  copy_of_one  one_upper_half  two
apple   100.0  False        100.0           100.0  200
ball    200.0  False        200.0           200.0  400
cerill    NaN  False          NaN             NaN  500
clock   300.0   True        300.0             NaN  600
dancy     NaN  False          NaN             NaN  500

In [94]:
df.duplicated()

apple     False
ball      False
cerill    False
clock     False
dancy      True
dtype: bool

In [96]:
df.drop_duplicates()

          one   flag  copy_of_one  one_upper_half  two
apple   100.0  False        100.0           100.0  200
ball    200.0  False        200.0           200.0  400
cerill    NaN  False          NaN             NaN  500
clock   300.0   True        300.0             NaN  600

In [40]:
df.dropna()

         one  two  copy_of_one   flag  one_upper_half
apple  100.0  200        100.0  False           100.0
ball   200.0  400        200.0  False           200.0

In [97]:
df

          one   flag  copy_of_one  one_upper_half  two
apple   100.0  False        100.0           100.0  200
ball    200.0  False        200.0           200.0  400
cerill    NaN  False          NaN             NaN  500
clock   300.0   True        300.0             NaN  600
dancy     NaN  False          NaN             NaN  500

In [98]:
df.fillna(df.sum())

          one   flag  copy_of_one  one_upper_half  two
apple   100.0  False        100.0           100.0  200
ball    200.0  False        200.0           200.0  400
cerill  600.0  False        600.0           300.0  500
clock   300.0   True        300.0           300.0  600
dancy   600.0  False        600.0           300.0  500

In [99]:
df

          one   flag  copy_of_one  one_upper_half  two
apple   100.0  False        100.0           100.0  200
ball    200.0  False        200.0           200.0  400
cerill    NaN  False          NaN             NaN  500
clock   300.0   True        300.0             NaN  600
dancy     NaN  False          NaN             NaN  500

In [100]:
df.replace(100, 10000, inplace=True)

In [101]:
df

            one   flag  copy_of_one  one_upper_half  two
apple   10000.0  False      10000.0         10000.0  200
ball      200.0  False        200.0           200.0  400
cerill      NaN  False          NaN             NaN  500
clock     300.0   True        300.0             NaN  600
dancy       NaN  False          NaN             NaN  500

# Agregación de Datos

In [102]:
df.groupby('one').count()

         flag  copy_of_one  one_upper_half  two
one
200.0       1            1               1    1
300.0       1            1               0    1
10000.0     1            1               1    1

In [103]:
df

            one   flag  copy_of_one  one_upper_half  two
apple   10000.0  False      10000.0         10000.0  200
ball      200.0  False        200.0           200.0  400
cerill      NaN  False          NaN             NaN  500
clock     300.0   True        300.0             NaN  600
dancy       NaN  False          NaN             NaN  500

In [105]:
df.groupby('one').mean()
#df.groupby('one').sum()

          flag  copy_of_one  one_upper_half  two
one
200.0    False        200.0           200.0  400
300.0     True        300.0             NaN  600
10000.0  False      10000.0         10000.0  200

In [111]:
import numpy as np
df.groupby('two').agg({'copy_of_one':[np.mean], 'two':np.sum})

    copy_of_one   two
           mean   sum
two
200     10000.0   200
400       200.0   400
500         NaN  1000
600       300.0   600

In [107]:
df

            one   flag  copy_of_one  one_upper_half  two
apple   10000.0  False      10000.0         10000.0  200
ball      200.0  False        200.0           200.0  400
cerill      NaN  False          NaN             NaN  500
clock     300.0   True        300.0             NaN  600
dancy       NaN  False          NaN             NaN  500

In [112]:
df2 = pd.concat([df,df])
df2

            one   flag  copy_of_one  one_upper_half  two
apple   10000.0  False      10000.0         10000.0  200
ball      200.0  False        200.0           200.0  400
cerill      NaN  False          NaN             NaN  500
clock     300.0   True        300.0             NaN  600
dancy       NaN  False          NaN             NaN  500
apple   10000.0  False      10000.0         10000.0  200
ball      200.0  False        200.0           200.0  400
cerill      NaN  False          NaN             NaN  500
clock     300.0   True        300.0             NaN  600
dancy       NaN  False          NaN             NaN  500

In [113]:
df2.groupby(['one']).agg({'copy_of_one':lambda x:sum(x), 'one': lambda x:np.mean(x)})

         copy_of_one      one
one
200.0          400.0    200.0
300.0          600.0    300.0
10000.0      20000.0  10000.0

In [120]:
df.isna().count()

#pd.isna(df).count()

one               5
flag              5
copy_of_one       5
one_upper_half    5
two               5
dtype: int64